R12/Test1.XML

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ns1:ItemPriceRequest xmlns:ns1="http://xmlns.irco.com/WebtopssItemPriceProvABCSImpl">
      <ControlArea>
        <PartnerCode>WEBTOPPS</PartnerCode>
        <InstanceName>INT2</InstanceName>
        <RequestType>PROCESS</RequestType>
        <MessageID>E3C3E45006B0489CE0430B63560AA260</MessageID>
      </ControlArea>
      <DataArea>
        <ItemPrice>
          <ConfiguredItem>YSC048E1ELA**000000000000000000000000000</ConfiguredItem>
          <ProductCode>2005045</ProductCode>
          <ProductFamily>2005045</ProductFamily>
          <PricelistName>kukrejatestPL0348224</PricelistName>
          <ListPrice>99</ListPrice>
          <UOM>EA</UOM>
          <POA>SAMPLE_POA</POA>
          <StartDate>2013-08-18T17:52:47</StartDate>
          <EndDate>2013-08-18T17:52:47</EndDate>
          <AccessoryFlag>N</AccessoryFlag>
          <AccessoryItem/>
          <ItemPriceFetch>
            <Header>
              <SourceHeaderRef>1876543</SourceHeaderRef>
              <OperatingUnitCode>USOUUSDRS</OperatingUnitCode>
              <BusinessUnit/>
              <PricingDate>2013-08-18T17:52:47</PricingDate>
              <CustomerNumber>35803</CustomerNumber>
              <SoldToSite>520531</SoldToSite>
              <CurrencyCode>USD</CurrencyCode>
              <CheckType>PRICE</CheckType>
              <Line>
                <SourceLineRef/>
                <PartNumber>THC036E1</PartNumber>
                <Quantity>1</Quantity>
                <UOM>EA</UOM>
                <SupplierNumber/>
                <ManufacturingLocation/>
                <DivisionCode/>
                <OrderType/>
                <ShipmentPriority/>
                <ShipFrom/>
                <LineCategory/>
                <FreightTerms/>
                <SalesChannel/>
                <BillTo/>
                <OrderSource/>
                <ModifierNumber/>
                <PricingAttribute1>150</PricingAttribute1>
                <ModelNumber/>
                <ItemType/>
              </Line>
            </Header>
          </ItemPriceFetch>
        </ItemPrice>
      </DataArea>
    </ns1:ItemPriceRequest>
  </soap:Body>
</soap:Envelope>